test/upward_seepage_new/mix_debug_B/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     mspCfdemSolverIBOpti;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         15;

deltaT          0.0002;

writeControl    adjustableRunTime;

writeInterval   0.025;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable off;//yes;

adjustTimeStep  no;

maxCo           1;

maxDeltaT       1;
