test/upward_seepage_new/mix_debug_B/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
  (0   0   0)
  (40.0 0   0)
  (40.0 40.0 0)
  (0   40.0 0)
  (0   0   100.0)
  (40.0 0   100.0)
  (40.0 40.0 100.0)
  (0   40.0 100.0)
  (0   0   200.0)
  (40.0 0   200.0)
  (40.0 40.0 200.0)
  (0   40.0 200.0)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (40 40 100) simpleGrading (1 1 1)
  hex (4 5 6 7 8 9 10 11) (40 40 60) simpleGrading (1 1 2)
  // hex (0 1 2 3 4 5 6 7) (30 30 80) simpleGrading (1 1 1)
  // hex (4 5 6 7 8 9 10 11) (30 30 40) simpleGrading (1 1 2)
);

patches
(
  wall inlet
  (
    (0 1 2 3)
  )
  wall walls
  (
    (1 5 4 0)
    (2 6 5 1)
    (3 7 6 2)
    (0 4 7 3)
    (5 9 8 4)
    (6 10 9 5)
    (7 11 10 6)
    (4 8 11 7)
  )
  wall outlet
  (
    (8 9 10 11)
  )
);
